Revit 2027 API
PrintParameters.PaperSize Property
 The page size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperSize PaperSize { get; set; }
Public Property PaperSize As PaperSize
	Get
	Set
public:
property PaperSize^ PaperSize {
	PaperSize^ get ();
	void set (PaperSize^ value);
}
member PaperSize : PaperSize with get, set
Property Value
PaperSize
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument is null.
ArgumentException |  Thrown when the input argument is invalid for current printer.
Remarks
 User can select the candidate via PaperSizes and then set the Page source of the Print Setting.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace